<?php

$GLOBALS['TAIHO'] = array
(
    "4BD1-M00"=>"大瓦标准",
    "4BD1-M25"=>"大瓦50",
    "4BD1-M50"=>"大瓦50",
    "4BD1-R00"=>"小瓦标准",
    "4BD1-R25"=>"小瓦25",
    "4BD1-R50"=>"小瓦50",
    "4BD1-C"=>"连杆铜套",
    "4D130-M00"=>"大瓦标准",
    "4D130-C"=>"连杆铜套",
    "4D31-M00"=>"大瓦标准",
    "4D31-M25"=>"大瓦50",
    "4D31-M50"=>"大瓦50",
    "4D31-R00"=>"小瓦标准",
    "4D31-R25"=>"小瓦25",
    "4D31-R50"=>"小瓦50",
    "4D31-T"=>"止推片",
    "4D34-R00"=>"小瓦标准",
    "4D34-R25"=>"小瓦25",
    "4D34-R50"=>"小瓦50",
    "4D34-R75"=>"小瓦75",
    "4D94E-M00"=>"大瓦标准",
    "4D94E-M25"=>"大瓦50",
    "4D94E-R00"=>"小瓦标准",
    "4D94E-R25"=>"小瓦25",
    "4D94E-C"=>"",
    "4D94E-T"=>"止推片",
    "4D95-M00"=>"大瓦标准",
    "4D95-M25"=>"大瓦50",
    "4D95-M50"=>"大瓦50",
    "4D95-R00"=>"小瓦标准",
    "4D95-R25"=>"小瓦25",
    "4D95-R50"=>"小瓦50",
    "4D95-R75"=>"小瓦75",
    "4D95-P"=>"",
    "4JB1-M00"=>"大瓦标准",
    "4JB1-M25"=>"大瓦50",
    "4JB1-M50"=>"大瓦50",
    "4JB1-R00"=>"小瓦标准",
    "4JB1-R25"=>"小瓦25",
    "4JB1-R50"=>"小瓦50",
    "4JB1-C"=>"连杆铜套",
    "4M40-M00"=>"大瓦标准",
    "4M40-M25"=>"大瓦50",
    "4M40-M50"=>"大瓦50",
    "4M40-R00"=>"小瓦标准",
    "4M40-R25"=>"小瓦25",
    "4M40-R50"=>"小瓦50",
    "4M40-C"=>"连杆铜套",
    "6BD1-M00TH"=>"",
    "6BD1-M25TH"=>"",
    "6BD1-M50TH"=>"",
    "6BD1-R00TH"=>"",
    "6BD1-R25"=>"小瓦25",
    "6BD1-R50"=>"小瓦50",
    "6BD1-C"=>"连杆铜套",
    "6BD1-T"=>"止推片",
    "6BD1-P"=>"",
    "6D105-M00"=>"大瓦标准",
    "6D105-M25"=>"大瓦50",
    "6D105-M50"=>"大瓦50",
    "6D105-M75"=>"大瓦75",
    "6D105-R00"=>"小瓦标准",
    "6D105-R25"=>"小瓦25",
    "6D105-R50"=>"小瓦50",
    "6D105-R75"=>"小瓦75",
    "6D105-C"=>"连杆铜套",
    "6D105-T"=>"止推片",
    "6D105-P"=>"",
    "6D125-M00"=>"大瓦标准",
    "6D125-M25"=>"大瓦50",
    "6D125-M50"=>"大瓦50",
    "6D125-R00"=>"小瓦标准",
    "6D125-R25"=>"小瓦25",
    "6D125-R50"=>"小瓦50",
    "6D130-M00"=>"大瓦标准",
    "6D130-M25"=>"大瓦50",
    "6D130-M50"=>"大瓦50",
    "6D130-R00"=>"小瓦标准",
    "6D130-R25"=>"小瓦25",
    "6D130-R50"=>"小瓦50",
    "6D14-C"=>"连杆铜套",
    "6D15-M00"=>"大瓦标准",
    "6D15-M25"=>"大瓦50",
    "6D15-M50"=>"大瓦50",
    "6D15-M75"=>"大瓦75",
    "6D15-R00"=>"小瓦标准",
    "6D15-R25"=>"小瓦25",
    "6D15-R50"=>"小瓦50",
    "6D15-R75"=>"小瓦75",
    "6D15-T"=>"止推片",
    "6D16A-C"=>"连杆铜套",
    "6D22-M00"=>"大瓦标准",
    "6D22-M25"=>"大瓦50",
    "6D22-M50"=>"大瓦50",
    "6D22-R00"=>"小瓦标准",
    "6D22-R25"=>"小瓦25",
    "6D22-R50"=>"小瓦50",
    "6D22-C"=>"连杆铜套",
    "6D31-M00"=>"大瓦标准",
    "6D31-M25"=>"大瓦50",
    "6D31-M50"=>"大瓦50",
    "6D31-R00"=>"小瓦标准",
    "6D31-R25"=>"小瓦25",
    "6D31-R50"=>"小瓦50",
    "6D31-C"=>"连杆铜套",
    "6D34-R00"=>"小瓦标准",
    "6D34-R25"=>"小瓦25",
    "6D34-R50"=>"小瓦50",
    "6D34-C"=>"连杆铜套",
    "6D95-M00"=>"大瓦标准",
    "6D95-M25"=>"大瓦50",
    "6D95-M50"=>"大瓦50",
    "6D95-R00"=>"小瓦标准",
    "6D95-R25"=>"小瓦25",
    "6D95-R25"=>"小瓦25",
    "6D95-B50-410"=>"",
    "6D95-R50"=>"小瓦50",
    "6D95-R75"=>"小瓦75",
    "6D95-C"=>"连杆铜套",
    "6D95-T"=>"止推片",
    "6D95-P"=>"",
    "6SD1-M00"=>"大瓦标准",
    "6SD1-M25"=>"大瓦50",
    "6SD1-M50"=>"大瓦50",
    "6SD1-R00"=>"小瓦标准",
    "6SD1-R25"=>"小瓦25",
    "6SD1-R50"=>"小瓦50",
    "EL100-R25"=>"小瓦25",
    "EL100-C"=>"连杆铜套",
    "HO6CT-M25"=>"大瓦50",
    "HO6CT-M50"=>"大瓦50",
    "HO6CT-R25"=>"小瓦25",
    "HO6CT-R50"=>"小瓦50",
    "S4F-M00"=>"大瓦标准",
    "S4F-M25"=>"大瓦50",
    "S4F-R00"=>"小瓦标准",
    "S4F-R25"=>"小瓦25",
    "S4F-C"=>"连杆铜套",
    "S6K-T"=>"止推片",
    "S6KT-M00"=>"大瓦标准",
    "S6KT-M25"=>"大瓦50",
    "S6KT-M50"=>"大瓦50",
    "S6KT-M75"=>"大瓦75",
    "S6KT-R00"=>"小瓦标准",
    "S6KT-R25"=>"小瓦25",
    "S6KT-R50"=>"小瓦50",
    "S6KT-R75"=>"小瓦75",
    "S6KT-C"=>"连杆铜套",
    "S6KT-P"=>""
);

function keytype($name)
{
    $index = 0;
    foreach ($GLOBALS['TAIHO'] as $key=>$value) {
        $index++;
        if (strpos(strtolower($key), $name) !== false) {
            break;
        }
    }    
    
    if( $index<=10 )
        return "brand";
    if( $index>10 && $index<=33)
        return "ebrand";
    if( $index>34 && $index<=562)
        return "series";
    if( $index>563)
        return "module";
}	

$q = strtolower($_GET["q"]);
if (!$q) return;
       
foreach ($GLOBALS['TAIHO'] as $key=>$value) {
	if (strpos(strtolower($key), $q) !== false) {
		echo "$key|$value\n";
	}
}


?>